{
    "intents":[
        {
            "tag": "add",
            "patterns": [
                "Sara has 5 apples. She buys 3 more. How many apples does Sara have in total?",
                "John has 8 marbles. He finds 4 more. How many marbles does John have now?",
                "Lisa has 12 pencils. She gives 7 to her friend. How many pencils does Lisa have left?",
                "Tom has 15 candies. He eats 9 of them. How many candies are left?",
                "A bakery has 20 cupcakes. They sell 6. How many cupcakes are left in the bakery?",
                "There are 25 students in a class. 13 more students join. How many students are in the class now?",
                "Mary has 9 toy cars. She gets 5 more as a gift. How many toy cars does Mary have in total?",
                "Alex has 18 stickers. He gives 10 to his sister. How many stickers does Alex have left?",
                "A farmer has 30 chickens. 8 more chickens hatch. How many chickens does the farmer have now?",
                "In a game, you score 15 points in the first round and 12 points in the second round. How many points did you score in total?",
                "There are 23 red balloons and 17 blue balloons. How many balloons are there in total?",
                "You have 14 dollars, and your friend gives you 9 more dollars. How much money do you have now?",
                "There are 40 books on the shelf. If 11 books are taken out, how many books are left?",
                "A box contains 25 chocolates. If you eat 6 of them, how many chocolates are left?",
                "There are 19 birds on a tree. 8 more birds join them. How many birds are on the tree now?",
                "Julia has 27 crayons, and she buys 14 more. How many crayons does Julia have?",
                "A store has 50 bags of chips. 22 bags are sold. How many bags of chips are left?",
                "You have 16 toy blocks, and your friend gives you 7 more. How many toy blocks do you have now?",
                "A football team scores 21 points in the first half and 14 points in the second half. How many points did they score in total?",
                "There are 35 students in the morning class and 18 students in the afternoon class. How many students are there in both classes?",
                "Linda has 9 kittens, and her neighbor gives her 11 more kittens. How many kittens does Linda have now?",
                "A box contains 24 pencils. If 6 pencils are taken out, how many pencils are left?",
                "There are 27 oranges in a basket. 15 more oranges are added. How many oranges are there in the basket now?",
                "You have 20 seashells, and you find 5 more at the beach. How many seashells do you have?",
                "A bakery sells 28 donuts in the morning and 19 donuts in the afternoon. How many donuts do they sell in total?",
                "There are 30 toy cars in a store. 9 more toy cars are delivered. How many toy cars are there now?",
                "Tom has 36 marbles, and he gives 16 to his friend. How many marbles does Tom have left?",
                "A school has 60 students in the first grade and 40 students in the second grade. How many students are there in the school?",
                "You have 25 stickers, and your friend gives you 8 more. How many stickers do you have in total?",
                "There are 22 apples on the tree. 7 apples fall down. How many apples are left on the tree?",
                "Mary had 5 apples, John had 3, and Sarah had 2. How many apples did they have together?",
                "In a basket, there were 10 oranges, 6 bananas, and 4 apples. How many fruits were there in total?",
                "A soccer team scored 3 goals in the first half, 2 in the second, and 1 in overtime. How many goals did they score?",
                "There are 8 red marbles, 6 blue marbles, and 4 green marbles in a bag. How many marbles are there in total?",
                "A recipe calls for 2 cups of flour, 1 cup of sugar, and 3 cups of milk. How many cups of ingredients are needed?",
                "A classroom has 25 students. If 7 students are absent today and 3 more join later, how many students are present?",
                "Sarah bought 5 books, John bought 4, and Emma bought 3. How many books did they buy together?",
                "A car traveled 60 miles on Monday, 75 miles on Tuesday, and 50 miles on Wednesday. How many miles did it travel in total?",
                "There are 12 pencils in one box, 8 in another, and 5 in a third box. How many pencils are there in total?",
                "A farmer collected 15 eggs in the morning, 8 in the afternoon, and 10 in the evening. How many eggs did he collect in total?",
                "A bakery sold 20 croissants, 15 muffins, and 12 donuts. How many pastries did they sell?",
                "A toy store has 30 action figures, 22 stuffed animals, and 18 board games. How many toys are there in total?",
                "During a picnic, 5 people brought 4 sandwiches each. How many sandwiches were there in total?",
                "There are 9 red balloons, 6 blue balloons, and 3 green balloons at the party. How many balloons are there in total?",
                "A puzzle has 500 pieces. If you add 200 more pieces from another puzzle, how many pieces do you have now?",
                "A grocery store sold 25 bags of chips, 18 cans of soda, and 10 candy bars. How many items were sold?",
                "There are 7 players on a basketball team. Each player scored 4 points. How many points did the team score in total?",
                "A school bus picked up 15 students in the morning, 12 in the afternoon, and 10 in the evening. How many students did it pick up?",
                "A restaurant served 50 plates of spaghetti, 30 pizzas, and 15 burgers. How many dishes were served?",
                "There are 8 red roses, 6 white roses, and 4 yellow roses in a bouquet. How many roses are there in total?",
                "A computer store sold 12 laptops, 9 desktops, and 6 tablets. How many devices were sold?",
                "There are 10 small boxes, each containing 5 chocolates. How many chocolates are there in total?",
                "A building has 6 floors. On each floor, there are 4 apartments. How many apartments are there in total?",
                "A baseball team scored 4 runs in the first inning, 3 in the second, and 2 in the third. How many runs did they score?",
                "A box contains 24 crayons, 18 colored pencils, and 12 markers. How many art supplies are in the box?",
                "There are 9 people in a meeting. Each person shook hands with every other person once. How many handshakes occurred?",
                "A garden has 7 rows of sunflowers, with 5 sunflowers in each row. How many sunflowers are there?",
                "A classroom has 20 desks, with 4 students sitting at each desk. How many students are in the classroom?",
                "A pizza has 8 slices. If you have 3 pizzas, how many slices do you have in total?",
                "A store sold 5 toy cars, 6 dolls, and 3 board games. How many toys were sold in total?"            
            ],
            "responses" : [
                "This is word problem of add.... 😊 😊 😊 😊 ",
                "😊 😊 😊 😊 Oh the value is increasing...."
            ]
        },
        {
            "tag":"sub",
            "patterns": [
                "Samantha had 15 apples and gave 6 to her friend. How many apples does she have left?",
                "There were 42 students in the class, but 17 of them went on a field trip. How many students are still in the class?",
                "A store had 98 chocolate bars, and 31 were sold. How many chocolate bars are left?",
                "John had $50, but he spent $27 on a video game. How much money does he have now?",
                "A garden had 64 flowers, and 19 of them were picked. How many flowers are still in the garden?",
                "There were 75 marbles in a jar, and 28 were taken out. How many marbles are left?",
                "Emily had 38 pencils, and she gave 12 to her classmates. How many pencils does she have now?",
                "A bakery had 56 cupcakes, and 8 were eaten. How many cupcakes are left?",
                "Sarah had 95 stickers, and she gave 47 to her brother. How many stickers does Sarah have left?",
                "There were 63 books in the library, and 19 were checked out. How many books are still in the library?",
                "Tom had 60 baseball cards, and he sold 25 of them. How many baseball cards does Tom have left?",
                "A restaurant had 120 plates, and 36 were used. How many plates are available?",
                "Mia had 85 candies, and she ate 14 of them. How many candies does Mia have left?",
                "A toy store had 72 action figures, and 23 were bought. How many action figures are left?",
                "David had $75, but he spent $43 on a toy. How much money does he have now?",
                "A farmer had 105 apples, and 59 were sold. How many apples are left?",
                "Nina had 54 stickers, and she gave 21 to her friend. How many stickers does Nina have left?",
                "There were 68 balloons, and 12 popped. How many balloons are still inflated?",
                "Liam had 49 marbles, and he lost 8 of them. How many marbles does Liam have left?",
                "A school had 240 pencils, and 135 were given to students. How many pencils are left?",
                "Sophia had 67 cookies, and she shared 23 with her siblings. How many cookies does Sophia have now?",
                "A store had 80 t-shirts, and 32 were sold. How many t-shirts are left?",
                "Ella had $60, but she spent $28 on a new dress. How much money does she have left?",
                "A zoo had 94 animals, and 15 were transferred to another zoo. How many animals are still at the zoo?",
                "Oliver had 78 trading cards, and he traded 19 of them. How many trading cards does Oliver have left?",
                "A bakery had 120 donuts, and 57 were bought. How many donuts are left?",
                "Sophie had 63 stickers, and she gave 29 to her friend. How many stickers does Sophie have left?",
                "There were 76 cupcakes, and 18 were eaten. How many cupcakes are still available?",
                "Daniel had 55 marbles, and he gave 10 to his cousin. How many marbles does Daniel have left?",
                "A school had 180 crayons, and 96 were distributed to students. How many crayons are left?",
                "Alice had 8 apples, but she gave 2 to Bob, 3 to Cindy, and 1 to David. How many apples does Alice have left?",
                "There were 15 candies in a jar. Sarah ate 3, Tom took 4, and Emily took 2. How many candies are left?",
                "A soccer team had 22 players. 5 players got injured, and 3 players had to leave early. How many players are still available?",
                "Alex had $50, but he spent $10 on lunch, $15 on a movie, and $8 on snacks. How much money does Alex have now?",
                "There were 36 students in a classroom. 12 of them went on a field trip, and 5 were absent. How many students are present?",
                "In a garden, there were 40 flowers. 8 were picked by Alice, 7 by Bob, and 6 by Carol. How many flowers are left in the garden?",
                "A bakery had 60 cookies. 20 were sold in the morning, and 15 were sold in the afternoon. How many cookies are still in the bakery?",
                "Jason had a collection of 75 trading cards. He traded 10 with Sarah and 8 with David. How many trading cards does Jason have now?",
                "There were 90 books on a shelf. 25 were borrowed by friends, and 12 were misplaced. How many books are still on the shelf?",
                "Amy had 24 marbles, and she gave 6 to Ben, 8 to Chris, and 4 to Emily. How many marbles does Amy have left?",
                "A restaurant had 50 slices of pizza. 18 slices were ordered by one group, and 10 slices were taken for delivery. How many slices are left?",
                "A toy store had 30 stuffed animals. 7 were bought by Tim, 6 by Jessica, and 5 by Mike. How many stuffed animals are in the store now?",
                "There were 100 balloons at a party. 30 were popped during the party, and 20 were given away. How many balloons are still at the party?",
                "Emma had a jar with 80 marbles. She lost 15, gave 10 to her friend, and sold 12. How many marbles are left in the jar?",
                "A classroom had 28 students. 8 students were absent, and 6 were on a field trip. How many students are in the classroom?",
                "There were 120 apples in a basket. 45 were used for making pies, and 30 were given to neighbors. How many apples are left in the basket?",
                "Sam had 60 trading cards. He traded 15 with Olivia, 10 with Lucas, and 8 with Emma. How many trading cards does Sam have now?",
                "A library had 150 books. 40 books were checked out, and 25 books were returned. How many books are currently in the library?",
                "Jenny had 36 stickers. She used 7 on her scrapbook, gave 9 to her brother, and 5 to her friend. How many stickers does Jenny have left?",
                "There were 80 cookies at a bake sale. 30 were sold in the morning, and 20 were sold in the afternoon. How many cookies are left?",
                "Mark had a jar with 64 marbles. He lost 18, gave 12 to his cousin, and sold 14. How many marbles are left in the jar?",
                "A garden had 90 flowers. 25 were picked by visitors, and 15 were used for a bouquet. How many flowers are still in the garden?",
                "A classroom had 42 students. 12 students were absent, and 8 were on a field trip. How many students are in the classroom?",
                "There were 110 apples in a crate. 35 were used for making cider, and 20 were given to friends. How many apples are left in the crate?",
                "Rachel had 56 trading cards. She traded 10 with Sarah, 14 with Jason, and 7 with David. How many trading cards does Rachel have now?",
                "A library had 180 books. 50 books were checked out, and 30 books were returned. How many books are currently in the library?",
                "John had 48 stickers. He used 12 on his art project, gave 9 to his sister, and 6 to his cousin. How many stickers does John have left?",
                "There were 70 cookies at a school event. 25 were eaten during lunch, and 15 were eaten during a snack break. How many cookies are left?",
                "Emily had a jar with 72 marbles. She lost 14, gave 10 to her friend, and sold 16. How many marbles are left in the jar?",
                "A garden had 100 flowers. 30 were picked by volunteers, and 20 were used for a floral arrangement. How many flowers are still in the garden?"
            
            ],
            "responses": [
                "So sad..😞😞😞😞 ",
                "😞😞😞😞This problem is of substraction...."
            ]
        },
        {
            "tag":"div",
            "patterns":[
                "If Sally has 24 apples and wants to share them equally among 6 friends, how many apples does each friend get?",
                "A bakery sold 360 cupcakes in a day. If they pack them in boxes of 12, how many boxes did they use?",
                "There are 48 students in a class, and they need to be divided into 4 equal groups. How many students are in each group?",
                "A car traveled 210 miles in 7 hours. What is its average speed in miles per hour?",
                "If a garden has 45 roses, and each row has 5 roses, how many rows are there in the garden?",
                "A pizza is divided into 8 equal slices. If John eats 3 slices, how many slices are left?",
                "A factory produces 540 toys in a day. If they want to distribute them equally in 9 stores, how many toys will each store receive?",
                "A farmer has 120 eggs, and he wants to pack them into cartons with 10 eggs each. How many cartons does he need?",
                "There are 60 marbles in a jar, and they need to be divided among 4 children equally. How many marbles does each child get?",
                "A train travels 480 miles in 4 hours. What is its average speed in miles per hour?",
                "In a bookshelf, there are 75 books. If each shelf can hold 5 books, how many shelves are needed?",
                "A box contains 96 chocolates. If they are packed into bags with 8 chocolates each, how many bags can be filled?",
                "A school has 420 students. If they want to form groups with 7 students each, how many groups can be formed?",
                "A soccer team won 12 games out of 24 played. What fraction represents their winning percentage?",
                "A restaurant sold 360 burgers in a day. If they want to make burger stacks of 6 burgers each, how many stacks can they make?",
                "There are 96 pencils in a box. If they are divided into packs with 4 pencils each, how many packs can be made?",
                "A garden has 36 rows, and each row has 6 sunflowers. How many sunflowers are there in total?",
                "A grocery store has 96 apples, and they want to put them in bags with 8 apples each. How many bags are needed?",
                "A classroom has 30 desks, and each desk can seat 3 students. How many students can be seated?",
                "A cyclist traveled 90 miles in 6 hours. What is their average speed in miles per hour?",
                "A carton contains 60 juice boxes. If they are distributed among 12 children equally, how many juice boxes does each child get?",
                "There are 144 candies in a jar, and they need to be distributed among 9 friends equally. How many candies will each friend receive?",
                "A book has 240 pages, and a student reads 20 pages each day. How many days will it take to finish the book?",
                "A company produces 720 computer chips in a day. If they want to package them in boxes with 24 chips each, how many boxes will they need?",
                "A school has 1500 students. If they want to form groups with 25 students each, how many groups can they create?",
                "A pool has 2100 gallons of water. If it takes 7 hours to fill it completely, how many gallons are filled per hour?",
                "A store has 360 socks, and they want to pack them into boxes with 6 socks each. How many boxes can be filled?",
                "A pizza is divided into 10 equal slices. If Jane eats 2 slices, how many slices are left?",
                "A farmer has 48 cows, and he wants to distribute them into 4 barns equally. How many cows will be in each barn?",
                "A train travels 600 miles in 5 hours. What is its average speed in miles per hour?",
                "In a crate, there are 120 oranges. If they are divided into bags with 12 oranges each, how many bags can be made?",
                "A classroom has 36 students, and they want to form groups with 4 students each. How many groups can be formed?",
                "A car traveled 270 miles in 9 hours. What is its average speed in miles per hour?",
                "A bakery sold 288 cookies in a day. If they want to pack them in boxes of 12, how many boxes did they use?",
                "There are 84 students in a school bus, and they need to be divided into 7 equal rows. How many students are in each row?",
                "A pizza is divided into 6 equal slices. If Mark eats 1 slice, how many slices are left?",
                "A factory produces 576 toys in a day. If they want to distribute them equally in 8 stores, how many toys will each store receive?",
                "A grocery store has 360 bananas. If they want to put them in baskets with 6 bananas each, how many baskets are needed?",
                "There are 150 marbles in a jar, and they need to be divided among 5 children equally. How many marbles does each child get?",
                "A pool is filled with 3000 gallons of water. If it takes 6 hours to drain it completely, how many gallons are drained per hour?",
                "A book has 180 pages, and a student reads 15 pages each day. How many days will it take to finish the book?",
                "A soccer team won 18 games out of 30 played. What fraction represents their winning percentage?",
                "A car traveled 324 miles in 6 hours. What is its average speed in miles per hour?",
                "A farmer has 180 eggs, and he wants to pack them into cartons with 6 eggs each. How many cartons does he need?",
                "A school has 720 students. If they want to form groups with 24 students each, how many groups can be formed?",
                "In a box, there are 64 chocolates. If they are packed into bags with 4 chocolates each, how many bags can be filled?",
                "There are 80 pencils in a box. If they are divided into packs with 10 pencils each, how many packs can be made?",
                "A classroom has 45 desks, and each desk can seat 5 students. How many students can be seated?",
                "A cyclist traveled 120 miles in 5 hours. What is their average speed in miles per hour?",
                "A carton contains 48 juice boxes. If they are distributed among 6 children equally, how many juice boxes does each child get?",
                "There are 144 candies in a jar, and they need to be distributed among 8 friends equally. How many candies will each friend receive?",
                "A company produces 480 computer chips in a day. If they want to package them in boxes with 12 chips each, how many boxes will they need?",
                "A school has 1200 students. If they want to form groups with 30 students each, how many groups can they create?",
                "A pool has 1800 gallons of water. If it takes 9 hours to fill it completely, how many gallons are filled per hour?",
                "A store has 540 socks, and they want to pack them into boxes with 9 socks each. How many boxes can be filled?",
                "A pizza is divided into 8 equal slices. If Sarah eats 2 slices, how many slices are left?"
            
            ],
            "responses":[
                "Divison problem 😞😞😞😞"
            ]
        },
        {
            "tag":"mul",
            "patterns": [
                "If Sarah buys 3 packs of pencils, and each pack contains 12 pencils, how many pencils does she have in total?",
                "A bakery makes 5 batches of 24 cookies each. How many cookies did they make in total?",
                "There are 4 boxes, and each box contains 6 books. How many books are there in all?",
                "A farmer has 2 fields. In the first field, he plants 8 rows of corn with 7 cornstalks in each row. How many cornstalks are there in total?",
                "If each pizza has 10 slices, and you order 3 pizzas, how many slices of pizza do you have?",
                "A construction company builds 7 houses, and each house has 6 rooms. How many rooms did they build in total?",
                "There are 9 bags, and each bag contains 5 apples. How many apples are there in all?",
                "In a week, a factory produces 10 cars, and each car has 4 tires. How many tires do they produce in a week?",
                "If a train travels at a speed of 60 miles per hour for 4 hours, how far does it travel?",
                "A classroom has 30 students, and each student has 5 pencils. How many pencils are there in the classroom?",
                "You have 2 jars of marbles. Each jar has 10 marbles. How many marbles do you have in total?",
                "A store sells 5 boxes of crayons, and each box contains 24 crayons. How many crayons are sold?",
                "A soccer team scores 3 goals in each of the 8 games they play. How many goals do they score in total?",
                "If there are 6 packs of juice, and each pack contains 6 juice boxes, how many juice boxes are there?",
                "There are 12 months in a year. How many days are there in a year if each month has 30 days?",
                "A gardener plants 4 rows of flowers, and each row has 9 flowers. How many flowers did the gardener plant?",
                "If a store sells 2 dozen cookies, and each dozen contains 12 cookies, how many cookies are sold?",
                "A factory produces 6 crates of oranges, and each crate contains 36 oranges. How many oranges do they produce?",
                "A baker makes 4 batches of cupcakes, and each batch has 18 cupcakes. How many cupcakes did the baker make?",
                "There are 3 bags of candy, and each bag contains 8 pieces of candy. How many pieces of candy are there?",
                "A school has 5 classrooms, and each classroom has 25 students. How many students are there in the school?",
                "If a car travels at a speed of 50 miles per hour for 6 hours, how far does it travel?",
                "You have 3 baskets, and each basket contains 15 apples. How many apples do you have in total?",
                "A store sells 7 boxes of chocolates, and each box contains 20 chocolates. How many chocolates are sold?",
                "A baseball team plays 10 games, and they score 5 runs in each game. How many runs do they score in total?",
                "If there are 4 bags of marbles, and each bag has 10 marbles, how many marbles are there in total?",
                "A school has 8 classrooms, and each classroom has 30 desks. How many desks are there in the school?",
                "A farmer has 5 fields. In the second field, he plants 9 rows of wheat with 8 plants in each row. How many wheat plants are there?",
                "A factory produces 3 crates of toys, and each crate contains 24 toys. How many toys do they produce?",
                "There are 6 dozen eggs. How many eggs are there in total?",
                "If a train travels at a speed of 70 miles per hour for 3 hours, how far does it travel?",
                "A store sells 9 packs of markers, and each pack contains 15 markers. How many markers are sold?",
                "A bakery makes 2 batches of muffins, and each batch has 20 muffins. How many muffins did they make?",
                "There are 10 bags, and each bag contains 7 candies. How many candies are there in all?",
                "In a week, a factory produces 8 bicycles, and each bicycle has 2 wheels. How many wheels do they produce in a week?",
                "If each sandwich has 4 slices of bread, and you order 5 sandwiches, how many slices of bread do you have?",
                "A classroom has 35 students, and each student has 4 notebooks. How many notebooks are there in the classroom?",
                "You have 4 jars of jam. Each jar has 8 ounces of jam. How many ounces of jam do you have in total?",
                "A store sells 6 boxes of shoes, and each box contains 12 pairs of shoes. How many pairs of shoes are sold?",
                "A soccer team scores 4 goals in each of the 6 games they play. How many goals do they score in total?",
                "If there are 7 packs of chips, and each pack contains 8 chips, how many chips are there in total?",
                "A gardener plants 6 rows of vegetables, and each row has 10 plants. How many vegetables did the gardener plant?",
                "If a store sells 3 dozen roses, and each dozen contains 12 roses, how many roses are sold?",
                "A factory produces 5 crates of televisions, and each crate contains 15 televisions. How many televisions do they produce?",
                "A baker makes 3 batches of bread, and each batch has 30 loaves of bread. How many loaves of bread did the baker make?",
                "There are 5 bags of candy, and each bag contains 10 pieces of candy. How many pieces of candy are there?",
                "A school has 4 classrooms, and each classroom has 20 students. How many students are there in the school?",
                "If a car travels at a speed of 60 miles per hour for 4 hours, how far does it travel?",
                "You have 5 baskets, and each basket contains 12 apples. How many apples do you have in total?",
                "A store sells 8 boxes of cookies, and each box contains 24 cookies. How many cookies are sold?",
                "A baseball team plays 9 games, and they score 6 runs in each game. How many runs do they score in total?",
                "If there are 6 bags of marbles, and each bag has 15 marbles, how many marbles are there in total?",
                "A school has 7 classrooms, and each classroom has 25 desks. How many desks are there in the school?",
                "A farmer has 4 fields. In the third field, he plants 7 rows of corn with 9 cornstalks in each row. How many cornstalks are there?",
                "A factory produces 4 crates of bicycles, and each crate contains 20 bicycles. How many bicycles do they produce?",
                "There are 8 dozen donuts. How many donuts are there in total?",
                "If a train travels at a speed of 75 miles per hour for 2 hours, how far does it travel?",
                "A store sells 5 packs of crayons, and each pack contains 36 crayons. How many crayons are sold?",
                "A bakery makes 7 batches of cupcakes, and each batch has 15 cupcakes. How many cupcakes did they make?",
                "There are 9 bags, and each bag contains 4 apples. How many apples are there in all?",
                "In a week, a factory produces 7 cars, and each car has 4 tires. How many tires do they produce in a week?"
            ],
            "responses":[
                "Multiply 😊 😊 😊 😊 "
            ]
        },
        {
            "tag":"lcm",
            "patterns":["Maria is planning a family reunion. She wants to buy enough chairs so that each table can seat 6 people. If Maria has 18 tables, what is the least number of chairs she needs to buy?",
                "Tom is a teacher who wants to distribute 36 pencils to his students in equal numbers. If he wants to give the same number of pencils to each student, how many students are there in his class?",
                "Sarah is organizing a book club meeting. She has 24 mystery novels and 18 science fiction novels. How many books does she need to bring to ensure that everyone gets the same book to read?",
                "A farmer wants to plant trees in rows. If he wants to plant 24 trees in each row and has 48 trees in total, how many rows will he need?",
                "A bakery is packaging cookies into boxes. They want each box to contain 15 cookies. If they have 90 cookies to package, how many boxes will they need?",
                "A school choir has 24 students, and they want to form groups with an equal number of students. What is the maximum number of groups they can form?",
                "There are 36 red balloons and 48 blue balloons to be divided equally into gift bags. How many balloons will be in each gift bag?",
                "In a garage, there are 18 bicycles and 24 skateboards. If they want to stack them in equal-sized rows, how many items will be in each row?",
                "A factory produces 30 toy cars in a day. How many days will it take for the factory to produce a total of 120 toy cars?",
                "A school has 120 students, and they want to distribute pencils equally among all the students. If they have 15 pencils, how many pencils will each student receive?",
                "John is organizing a movie night. He has 35 friends coming over, and he wants to buy enough popcorn bags so that each bag can be shared by 5 friends. How many popcorn bags should John buy?",
                "A librarian is arranging 54 books on a shelf. If she wants to have an equal number of books in each row and at least 6 rows, how many books will be in each row?",
                "A car rental agency has 60 cars, and they want to park them in rows with the same number of cars in each row. What is the maximum number of cars they can have in each row?",
                "A group of friends wants to share 56 candies equally. How many candies will each friend get?",
                "A box contains 72 chocolates, and they want to divide them into smaller boxes with the same number of chocolates in each box. What is the maximum number of chocolates they can have in each smaller box?",
                "A teacher has 80 math books and 96 science books. She wants to arrange them in stacks with the same number of books in each stack. What is the maximum number of books in each stack?",
                "A factory produces 25 computer monitors in a day. How many days will it take for the factory to produce a total of 100 monitors?",
                "A garden has 96 flowers, and they want to plant them in rows with the same number of flowers in each row. What is the maximum number of flowers they can have in each row?",
                "A toy store has 45 action figures and 60 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A classroom has 30 students, and the teacher wants to distribute 120 pencils equally among them. How many pencils will each student receive?",
                "A group of friends has 24 marbles, and they want to share them equally. How many marbles will each friend receive?",
                "A toy store has 36 toy cars and 54 toy trains. They want to display them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 40 cows, and he wants to build equal-sized groups of cows to graze in different fields. What is the maximum number of cows in each group?",
                "A bakery has 75 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 90 students, and they want to distribute 270 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 120 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 15 bicycles in a day. How many days will it take for the factory to produce a total of 60 bicycles?",
                "A library has 48 fiction books and 72 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 84 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 35 students, and the teacher wants to distribute 140 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 64 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 30 stuffed animals and 45 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 54 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 120 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 75 students, and they want to distribute 225 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 90 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 20 washing machines in a day. How many days will it take for the factory to produce a total of 80 washing machines?",
                "A library has 60 mystery novels and 84 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 99 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 40 students, and the teacher wants to distribute 160 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 80 candies equally. How many candies will each friend get?",
                "A toy store has 48 action figures and 72 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 36 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 64 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 80 students, and they want to distribute 240 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 110 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 18 washing machines in a day. How many days will it take for the factory to produce a total of 72 washing machines?",
                "A library has 50 fiction books and 75 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 105 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 50 students, and the teacher wants to distribute 200 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 72 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 42 stuffed animals and 63 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 45 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 96 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 90 students, and they want to distribute 270 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 120 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 16 washing machines in a day. How many days will it take for the factory to produce a total of 64 washing machines?",
                "A library has 80 mystery novels and 100 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 96 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 60 students, and the teacher wants to distribute 240 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 96 candies equally. How many candies will each friend get?",
                "A toy store has 54 action figures and 72 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 48 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 108 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 120 students, and they want to distribute 360 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 150 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 24 washing machines in a day. How many days will it take for the factory to produce a total of 96 washing machines?",
                "A library has 72 fiction books and 120 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 126 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 75 students, and the teacher wants to distribute 300 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 112 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 60 stuffed animals and 90 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 60 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 120 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 150 students, and they want to distribute 450 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 180 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 30 washing machines in a day. How many days will it take for the factory to produce a total of 120 washing machines?",
                "A library has 84 mystery novels and 112 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 144 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 90 students, and the teacher wants to distribute 360 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 128 candies equally. How many candies will each friend get?",
                "A toy store has 72 action figures and 96 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 72 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 144 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 180 students, and they want to distribute 540 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 200 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 40 washing machines in a day. How many days will it take for the factory to produce a total of 160 washing machines?",
                "A library has 90 fiction books and 120 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 162 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 105 students, and the teacher wants to distribute 420 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 144 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 90 stuffed animals and 120 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 90 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 180 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 200 students, and they want to distribute 600 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 220 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 50 washing machines in a day. How many days will it take for the factory to produce a total of 200 washing machines?",
                "A library has 110 mystery novels and 140 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 198 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 120 students, and the teacher wants to distribute 480 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 160 candies equally. How many candies will each friend get?",
                "A toy store has 108 action figures and 144 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 120 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 216 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 240 students, and they want to distribute 720 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 250 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 60 washing machines in a day. How many days will it take for the factory to produce a total of 240 washing machines?",
                "A library has 120 fiction books and 160 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 252 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 135 students, and the teacher wants to distribute 540 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 192 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 126 stuffed animals and 168 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 144 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 288 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 300 students, and they want to distribute 900 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 300 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 75 washing machines in a day. How many days will it take for the factory to produce a total of 300 washing machines?",
                "A library has 150 mystery novels and 200 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 324 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 150 students, and the teacher wants to distribute 600 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 240 candies equally. How many candies will each friend get?",
                "A toy store has 162 action figures and 216 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 180 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 360 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 400 students, and they want to distribute 1200 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 500 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 80 washing machines in a day. How many days will it take for the factory to produce a total of 320 washing machines?",
                "A library has 180 fiction books and 240 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 396 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 225 students, and the teacher wants to distribute 900 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 288 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 198 stuffed animals and 264 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 216 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 432 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 450 students, and they want to distribute 1350 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 550 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 90 washing machines in a day. How many days will it take for the factory to produce a total of 360 washing machines?",
                "A library has 200 mystery novels and 270 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 486 bananas, and they want to pack them into bags with the same number of bananas in each bag. What is the maximum number of bananas in each bag?",
                "A classroom has 270 students, and the teacher wants to distribute 1080 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 336 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 252 action figures and 336 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 288 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 576 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 600 students, and they want to distribute 1800 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 700 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 120 washing machines in a day. How many days will it take for the factory to produce a total of 480 washing machines?",
                "A library has 270 fiction books and 360 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 594 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 315 students, and the teacher wants to distribute 1260 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 384 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 324 action figures and 432 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 360 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 720 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 750 students, and they want to distribute 2250 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 800 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 150 washing machines in a day. How many days will it take for the factory to produce a total of 600 washing machines?",
                "A library has 360 mystery novels and 480 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 810 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 405 students, and the teacher wants to distribute 1620 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 480 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 360 stuffed animals and 480 building blocks. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 480 horses, and he wants to build equal-sized groups of horses in different paddocks. What is the maximum number of horses in each paddock?",
                "A bakery has 960 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 1000 students, and they want to distribute 3000 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 1100 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 200 washing machines in a day. How many days will it take for the factory to produce a total of 800 washing machines?",
                "A library has 450 fiction books and 600 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 891 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 540 students, and the teacher wants to distribute 2160 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 576 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 486 action figures and 648 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 600 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 1200 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 1250 students, and they want to distribute 3750 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 1320 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 250 washing machines in a day. How many days will it take for the factory to produce a total of 1000 washing machines?",
                "A library has 540 mystery novels and 720 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 1080 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 675 students, and the teacher wants to distribute 2700 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 768 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 648 action figures and 864 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 720 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 1440 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 1500 students, and they want to distribute 4500 notebooks equally among them. How many notebooks will each student receive?",
                "A group of friends wants to buy 1650 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 300 washing machines in a day. How many days will it take for the factory to produce a total of 1200 washing machines?",
                "A library has 720 fiction books and 960 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 1458 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 810 students, and the teacher wants to distribute 3240 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 960 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 810 action figures and 1080 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 900 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 1800 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 2000 students, and they want to distribute 6000 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 2200 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 400 washing machines in a day. How many days will it take for the factory to produce a total of 1600 washing machines?",
                "A library has 900 mystery novels and 1200 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 1944 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 1080 students, and the teacher wants to distribute 4320 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 1152 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 972 action figures and 1296 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 1080 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 2160 cupcakes, and they want to pack them into boxes with the same number of cupcakes in each box. What is the maximum number of cupcakes in each box?",
                "A school has 2250 students, and they want to distribute 6750 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 2475 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 500 washing machines in a day. How many days will it take for the factory to produce a total of 2000 washing machines?",
                "A library has 1080 fiction books and 1440 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 2430 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 1215 students, and the teacher wants to distribute 4860 erasers equally among them. How many erasers will each student receive?",
                "A group of friends wants to share 1440 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 1215 action figures and 1620 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 1350 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 2700 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 3000 students, and they want to distribute 9000 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 3300 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 600 washing machines in a day. How many days will it take for the factory to produce a total of 2400 washing machines?",
                "A library has 1350 mystery novels and 1800 science fiction novels. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 2916 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?",
                "A classroom has 1620 students, and the teacher wants to distribute 6480 markers equally among them. How many markers will each student receive?",
                "A group of friends wants to share 1920 chocolates equally. How many chocolates will each friend get?",
                "A toy store has 1620 action figures and 2160 dolls. They want to arrange them on shelves with the same number of toys on each shelf. What is the maximum number of toys on each shelf?",
                "A farmer has 1800 sheep, and he wants to build equal-sized groups of sheep in different pens. What is the maximum number of sheep in each pen?",
                "A bakery has 3600 muffins, and they want to pack them into boxes with the same number of muffins in each box. What is the maximum number of muffins in each box?",
                "A school has 3750 students, and they want to distribute 11250 textbooks equally among them. How many textbooks will each student receive?",
                "A group of friends wants to buy 4125 movie tickets and distribute them equally. How many tickets will each friend get?",
                "A factory produces 750 washing machines in a day. How many days will it take for the factory to produce a total of 3000 washing machines?",
                "A library has 1800 fiction books and 2400 non-fiction books. They want to arrange them on shelves with the same number of books on each shelf. What is the maximum number of books on each shelf?",
                "A grocery store has 4860 apples, and they want to pack them into bags with the same number of apples in each bag. What is the maximum number of apples in each bag?"
            ],
            "responses":[
                "An L.C.M problem ............."
            ]
        },
        {
            "tag": "hcf",
            "patterns": [
                "Find the HCF of 12 and 18.",
                "If there are 20 students and 25 textbooks, how many students can share a textbook such that each student gets one?",
                "A bakery has 36 chocolate muffins and 48 blueberry muffins. How many boxes can they pack with the same number of each type of muffin in each box?",
                "A factory produces 120 cars and 150 motorcycles. What's the maximum number of vehicles they can store with an equal number of cars and motorcycles in each storage area?",
                "If you have 24 pencils and 36 erasers, how many school kits can you create with an equal number of pencils and erasers in each kit?",
                "In a school library, there are 50 math books and 60 science books. How many shelves can you fill with an equal number of each type of book?",
                "A farmer has 90 apples and 120 oranges. What's the largest number of fruit baskets he can create with an equal number of apples and oranges in each basket?",
                "There are 20 red balloons and 30 blue balloons. How many children can receive an equal number of red and blue balloons?",
                "If you have 80 chocolates and 100 candies, what's the greatest number of gift bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 35 boys and 42 girls. How many desks should be arranged so that there's an equal number of boys and girls in each row?",
                "Find the HCF of 15 and 25.",
                "A store has 48 toy trucks and 72 toy cars. How many toy sets can they create with an equal number of trucks and cars in each set?",
                "A factory produces 150 bicycles and 180 scooters. What's the largest number of vehicles they can ship with an equal number of bicycles and scooters in each shipment?",
                "If there are 30 computers and 40 students in a computer lab, how many students can work on each computer if they are shared equally?",
                "In a store, there are 25 red shirts and 35 blue shirts. How many racks can you fill with an equal number of each color of shirt?",
                "A farmer has 110 cows and 132 goats. What's the maximum number of animal pens he can create with an equal number of cows and goats in each pen?",
                "There are 28 green marbles and 42 yellow marbles. How many kids can receive an equal number of green and yellow marbles?",
                "If you have 56 cookies and 70 brownies, what's the largest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 40 girls and 50 boys. How many study groups can be formed with an equal number of girls and boys in each group?",
                "Find the HCF of 16 and 24.",
                "If a box contains 30 red balls and 45 blue balls, how many balls can be taken out to make sure you get the same number of each color?",
                "A factory produces 180 chairs and 210 tables. What's the maximum number of furniture sets they can assemble with an equal number of chairs and tables in each set?",
                "If there are 50 candies and 60 children at a party, how many candies can each child receive if they are distributed equally?",
                "In a store, there are 36 white shirts and 48 black shirts. How many hangers can you fill with an equal number of each color of shirt?",
                "A farmer has 126 apples and 154 pears. What's the maximum number of fruit baskets he can create with an equal number of apples and pears in each basket?",
                "There are 30 blue balloons and 45 red balloons. How many children can receive an equal number of blue and red balloons?",
                "If you have 64 chocolates and 80 candies, what's the greatest number of party favor bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 42 girls and 56 boys. How many teams can be formed with an equal number of girls and boys on each team?",
                "Find the HCF of 8 and 12.",
                "A garden has 50 roses and 75 tulips. How many flower bouquets can be made with an equal number of roses and tulips in each bouquet?",
                "A factory produces 90 televisions and 120 refrigerators. What's the maximum number of appliances they can store with an equal number of televisions and refrigerators in each storage area?",
                "If there are 24 apples and 36 oranges in a basket, how many pieces of fruit can you take out to make sure you get the same number of each type?",
                "In a store, there are 56 books and 72 magazines. How many shelves can you fill with an equal number of each type of reading material?",
                "A farmer has 140 cows and 168 sheep. What's the largest number of animal pens he can create with an equal number of cows and sheep in each pen?",
                "There are 40 red marbles and 60 green marbles. How many children can receive an equal number of red and green marbles?",
                "If you have 75 cookies and 90 brownies, what's the largest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 48 boys and 60 girls. How many study groups can be formed with an equal number of boys and girls in each group?",
                "Find the HCF of 10 and 15.",
                "If there are 24 students and 36 chairs in a classroom, how many students can sit down so that each chair has an occupant?",
                "A bakery has 80 chocolate cupcakes and 100 vanilla cupcakes. How many cupcake boxes can they create with an equal number of chocolate and vanilla cupcakes in each box?",
                "A factory produces 200 mobile phones and 240 tablets. What's the maximum number of electronic devices they can package with an equal number of mobile phones and tablets in each package?",
                "If you have 64 pens and 80 pencils, how many pencil cases can you fill with an equal number of pens and pencils in each case?",
                "In a store, there are 60 shirts and 75 pants. How many clothing sets can you create with an equal number of shirts and pants in each set?",
                "A farmer has 180 apples and 216 peaches. What's the largest number of fruit baskets he can create with an equal number of apples and peaches in each basket?",
                "There are 45 red balloons and 63 blue balloons. How many children can receive an equal number of red and blue balloons?",
                "If you have 100 chocolates and 120 candies, what's the greatest number of gift bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 54 girls and 72 boys. How many teams can be formed with an equal number of girls and boys on each team?",
                "Find the HCF of 9 and 12.",
                "A store has 40 toy cars and 60 toy trucks. How many toy sets can they create with an equal number of cars and trucks in each set?",
                "A factory produces 120 laptops and 144 tablets. What's the largest number of electronic devices they can ship with an equal number of laptops and tablets in each shipment?",
                "If there are 32 computers and 48 students in a computer lab, how many students can work on each computer if they are shared equally?",
                "In a store, there are 66 red shirts and 88 blue shirts. How many racks can you fill with an equal number of each color of shirt?",
                "A farmer has 99 cows and 132 goats. What's the maximum number of animal pens he can create with an equal number of cows and goats in each pen?",
                "There are 36 green marbles and 54 yellow marbles. How many kids can receive an equal number of green and yellow marbles?",
                "If you have 72 cookies and 90 brownies, what's the largest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 60 girls and 80 boys. How many study groups can be formed with an equal number of girls and boys in each group?",
                "Find the HCF of 7 and 14.",
                "If a box contains 28 red balls and 56 blue balls, how many balls can be taken out to make sure you get the same number of each color?",
                "A factory produces 100 bicycles and 120 scooters. What's the maximum number of vehicles they can assemble with an equal number of bicycles and scooters in each assembly line?",
                "If there are 48 candies and 72 children at a party, how many candies can each child receive if they are distributed equally?",
                "In a store, there are 45 white shirts and 63 black shirts. How many hangers can you fill with an equal number of each color of shirt?",
                "A farmer has 105 apples and 140 pears. What's the maximum number of fruit baskets he can create with an equal number of apples and pears in each basket?",
                "There are 35 blue balloons and 49 red balloons. How many children can receive an equal number of blue and red balloons?",
                "If you have 49 chocolates and 63 candies, what's the greatest number of party favor bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 63 girls and 84 boys. How many teams can be formed with an equal number of girls and boys on each team?",
                "Find the HCF of 6 and 18.",
                "A garden has 70 roses and 105 tulips. How many flower bouquets can be made with an equal number of roses and tulips in each bouquet?",
                "A factory produces 150 chairs and 180 tables. What's the maximum number of furniture sets they can assemble with an equal number of chairs and tables in each set?",
                "If there are 40 apples and 60 oranges in a basket, how many pieces of fruit can you take out to make sure you get the same number of each type?",
                "In a store, there are 63 books and 84 magazines. How many shelves can you fill with an equal number of each type of reading material?",
                "A farmer has 126 cows and 168 sheep. What's the largest number of animal pens he can create with an equal number of cows and sheep in each pen?",
                "There are 42 red marbles and 56 green marbles. How many children can receive an equal number of red and green marbles?",
                "If you have 90 cookies and 108 brownies, what's the largest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 72 boys and 96 girls. How many study groups can be formed with an equal number of boys and girls in each group?",
                "Find the HCF of 5 and 10.",
                "If there are 30 students and 50 chairs in a classroom, how many students can sit down so that each chair has an occupant?",
                "A bakery has 60 chocolate cupcakes and 75 vanilla cupcakes. How many cupcake boxes can they create with an equal number of chocolate and vanilla cupcakes in each box?",
                "A factory produces 160 mobile phones and 200 tablets. What's the maximum number of electronic devices they can package with an equal number of mobile phones and tablets in each package?",
                "If you have 48 pens and 60 pencils, how many pencil cases can you fill with an equal number of pens and pencils in each case?",
                "In a store, there are 70 shirts and 84 pants. How many clothing sets can you create with an equal number of shirts and pants in each set?",
                "A farmer has 144 apples and 180 peaches. What's the largest number of fruit baskets he can create with an equal number of apples and peaches in each basket?",
                "There are 36 blue balloons and 54 red balloons. How many children can receive an equal number of blue and red balloons?",
                "If you have 84 chocolates and 105 candies, what's the greatest number of gift bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 80 girls and 100 boys. How many teams can be formed with an equal number of girls and boys on each team?",
                "Find the HCF of 4 and 8.",
                "A store has 50 toy cars and 75 toy trucks. How many toy sets can they create with an equal number of cars and trucks in each set?",
                "A factory produces 130 laptops and 156 tablets. What's the largest number of electronic devices they can ship with an equal number of laptops and tablets in each shipment?",
                "If there are 36 computers and 54 students in a computer lab, how many students can work on each computer if they are shared equally?",
                "In a store, there are 80 red shirts and 100 blue shirts. How many racks can you fill with an equal number of each color of shirt?",
                "A farmer has 112 cows and 140 goats. What's the maximum number of animal pens he can create with an equal number of cows and goats in each pen?",
                "There are 48 green marbles and 72 yellow marbles. How many kids can receive an equal number of green and yellow marbles?",
                "If you have 96 cookies and 120 brownies, what's the largest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 90 girls and 120 boys. How many study groups can be formed with an equal number of girls and boys in each group?",
                "Find the HCF of 3 and 9.",
                "A garden has 105 roses and 140 tulips. How many flower bouquets can be made with an equal number of roses and tulips in each bouquet?",
                "A factory produces 120 chairs and 144 tables. What's the maximum number of furniture sets they can assemble with an equal number of chairs and tables in each set?",
                "If there are 50 apples and 75 oranges in a basket, how many pieces of fruit can you take out to make sure you get the same number of each type?",
                "In a store, there are 84 books and 112 magazines. How many shelves can you fill with an equal number of each type of reading material?",
                "A farmer has 168 cows and 224 sheep. What's the largest number of animal pens he can create with an equal number of cows and sheep in each pen?",
                "There are 56 red marbles and 70 green marbles. How many children can receive an equal number of red and green marbles?",
                "If you have 100 cookies and 126 brownies, what's the greatest number of treat boxes you can make with an equal number of cookies and brownies in each box?",
                "A classroom has 96 boys and 128 girls. How many study groups can be formed with an equal number of boys and girls in each group?",
                "Find the HCF of 2 and 4.",
                "If a box contains 14 red balls and 28 blue balls, how many balls can be taken out to make sure you get the same number of each color?",
                "A factory produces 80 bicycles and 96 scooters. What's the maximum number of vehicles they can assemble with an equal number of bicycles and scooters in each assembly line?",
                "If there are 24 candies and 36 children at a party, how many candies can each child receive if they are distributed equally?",
                "In a store, there are 28 white shirts and 42 black shirts. How many hangers can you fill with an equal number of each color of shirt?",
                "A farmer has 77 apples and 110 pears. What's the maximum number of fruit baskets he can create with an equal number of apples and pears in each basket?",
                "There are 21 blue balloons and 28 red balloons. How many children can receive an equal number of blue and red balloons?",
                "If you have 56 chocolates and 70 candies, what's the greatest number of party favor bags you can fill with an equal number of chocolates and candies?",
                "A classroom has 56 girls and 84 boys. How many teams can be formed with an equal number of girls and boys on each team?"
            ],
            "responses":[
                "Ohhhh........ Sir HCF"
            ]
        },
        {
            "tag":"direct",
            "patterns":[
                "A man spends Rs. 2080 in 13 days. How much will he spend in 30 days?",
                "If 5 apples cost $10, how much do 7 apples cost?",
                "If a car travels 60 miles in 2 hours, how far will it travel in 5 hours?",
                "If 4 workers can build a wall in 6 days, how long will it take for 6 workers to build the same wall?",
                "If it takes 8 hours to complete a 320-page book, how long will it take to complete a 400-page book?",
                "If a machine can produce 500 widgets in 4 hours, how many widgets can it produce in 6 hours?",
                "If a train travels at a speed of 80 km/h, how far will it travel in 3 hours?",
                "If 3 students can solve 45 math problems in 5 hours, how long will it take 5 students to solve the same number of problems?",
                "If a factory produces 200 cars in a month, how many cars will it produce in a year?",
                "If 10 meters of fabric cost $50, how much will 15 meters of the same fabric cost?",
                "If a light bulb consumes 60 watts of electricity in an hour, how much electricity will it consume in 8 hours?",
                "If a bakery can bake 24 cupcakes in 2 hours, how many cupcakes can it bake in 6 hours?",
                "If a river flows at a rate of 5 meters per second, how far will a boat travel in 10 seconds?",
                "If a cyclist rides at a speed of 15 km/h, how long will it take to cover a distance of 75 km?",
                "If 6 workers can complete a project in 9 days, how many days will it take for 4 workers to complete the same project?",
                "If a car can hold 40 liters of fuel and travels 320 km on a full tank, how far will it travel on 50 liters of fuel?",
                "If 8 students can clean a classroom in 2 hours, how long will it take for 12 students to clean the same classroom?",
                "If a printer can print 60 pages in 5 minutes, how many pages can it print in 20 minutes?",
                "If a garden hose can fill a 500-liter tank in 10 minutes, how long will it take to fill a 750-liter tank?",
                "If a bakery sells 20 croissants for $30, how much will 10 croissants cost?",
                "If a machine can produce 120 toys in 3 hours, how many toys can it produce in 6 hours?",
                "If a train travels at a speed of 100 km/h, how long will it take to cover a distance of 200 km?",
                "If a motorbike can cover 150 miles on 5 gallons of gasoline, how far can it travel on 3 gallons?",
                "If 5 workers can paint a room in 8 hours, how long will it take for 3 workers to paint the same room?",
                "If a car travels 300 miles in 4 hours, what is its average speed?",
                "If a factory produces 6000 toys in a week, how many toys will it produce in 4 weeks?",
                "If a chef can prepare 15 pizzas in 30 minutes, how many can they prepare in 2 hours?",
                "If a car can go 40 miles on 2 gallons of gas, how many miles can it go on 5 gallons?",
                "If 3 workers can build a house in 180 days, how long will it take for 6 workers to build the same house?",
                "If a machine can produce 200 units in 2 hours, how many units can it produce in 5 hours?",
                "If a train travels at a speed of 120 km/h, how long will it take to cover a distance of 360 km?",
                "If a car can travel 200 miles on a tank of gas, how far can it go on 3 tanks?",
                "If 6 workers can complete a project in 12 days, how many days will it take for 8 workers to complete the same project?",
                "If a printer can print 40 pages in 4 minutes, how many pages can it print in 20 minutes?",
                "If a factory can produce 4000 widgets in a day, how many can it produce in a month?",
                "If a bakery can bake 36 cupcakes in 3 hours, how many cupcakes can it bake in 7 hours?",
                "If a garden hose can fill a 750-liter tank in 15 minutes, how long will it take to fill a 1000-liter tank?",
                "If a car can hold 60 liters of fuel and travels 360 km on a full tank, how far will it travel on 40 liters of fuel?",
                "If 8 students can clean a classroom in 3 hours, how long will it take for 6 students to clean the same classroom?",
                "If a train travels at a speed of 90 km/h, how long will it take to cover a distance of 270 km?",
                "If a motorbike can cover 180 miles on 6 gallons of gasoline, how far can it travel on 4 gallons?",
                "If a machine can produce 180 toys in 6 hours, how many toys can it produce in 3 hours?",
                "If a chef can prepare 20 pizzas in 40 minutes, how many can they prepare in 2 hours?",
                "If a car can go 50 miles on 2 gallons of gas, how many miles can it go on 6 gallons?",
                "If 5 workers can paint a room in 10 hours, how long will it take for 2 workers to paint the same room?",
                "If a car travels 400 miles in 5 hours, what is its average speed?",
                "If a factory produces 8000 toys in a week, how many toys will it produce in 2 weeks?",
                "If a train travels at a speed of 150 km/h, how long will it take to cover a distance of 450 km?",
                "If a car can travel 300 miles on a tank of gas, how far can it go on 2 tanks?",
                "If 4 workers can build a house in 120 days, how long will it take for 7 workers to build the same house?",
                "If a machine can produce 240 units in 3 hours, how many units can it produce in 8 hours?",
                "If a printer can print 50 pages in 5 minutes, how many pages can it print in 25 minutes?",
                "If a factory can produce 6000 widgets in a day, how many can it produce in a year?",
                "If a bakery can bake 30 cupcakes in 2 hours, how many cupcakes can it bake in 5 hours?",
                "If a garden hose can fill a 1000-liter tank in 20 minutes, how long will it take to fill a 1500-liter tank?",
                "If a car can hold 70 liters of fuel and travels 420 km on a full tank, how far will it travel on 50 liters of fuel?",
                "If 6 students can clean a classroom in 4 hours, how long will it take for 9 students to clean the same classroom?",
                "If a train travels at a speed of 120 km/h, how long will it take to cover a distance of 240 km?",
                "If a motorbike can cover 160 miles on 4 gallons of gasoline, how far can it travel on 8 gallons?",
                "If a machine can produce 200 toys in 2 hours, how many toys can it produce in 4 hours?",
                "If a chef can prepare 30 pizzas in 60 minutes, how many can they prepare in 3 hours?",
                "If a car can go 60 miles on 3 gallons of gas, how many miles can it go on 5 gallons?",
                "If 4 workers can build a house in 150 days, how long will it take for 8 workers to build the same house?",
                "If a machine can produce 160 units in 4 hours, how many units can it produce in 6 hours?",
                "If a printer can print 70 pages in 7 minutes, how many pages can it print in 35 minutes?",
                "If a factory can produce 8000 widgets in a week, how many can it produce in 6 weeks?",
                "If a bakery can bake 45 cupcakes in 3 hours, how many cupcakes can it bake in 9 hours?",
                "If a garden hose can fill a 1200-liter tank in 30 minutes, how long will it take to fill a 1800-liter tank?",
                "If a car can hold 80 liters of fuel and travels 480 km on a full tank, how far will it travel on 70 liters of fuel?",
                "If 5 students can clean a classroom in 6 hours, how long will it take for 10 students to clean the same classroom?",
                "If a train travels at a speed of 150 km/h, how long will it take to cover a distance of 300 km?",
                "If a motorbike can cover 140 miles on 7 gallons of gasoline, how far can it travel on 2 gallons?",
                "If a machine can produce 250 toys in 5 hours, how many toys can it produce in 3 hours?",
                "If a chef can prepare 40 pizzas in 80 minutes, how many can they prepare in 4 hours?",
                "If a car can go 70 miles on 2 gallons of gas, how many miles can it go on 10 gallons?",
                "If 6 workers can build a house in 180 days, how long will it take for 9 workers to build the same house?",
                "If a machine can produce 180 units in 6 hours, how many units can it produce in 9 hours?",
                "If a printer can print 80 pages in 8 minutes, how many pages can it print in 40 minutes?",
                "If a factory can produce 9000 widgets in a day, how many can it produce in a month?",
                "If a bakery can bake 50 cupcakes in 4 hours, how many cupcakes can it bake in 8 hours?",
                "If a garden hose can fill a 1500-liter tank in 40 minutes, how long will it take to fill a 2000-liter tank?",
                "If a car can hold 90 liters of fuel and travels 540 km on a full tank, how far will it travel on 60 liters of fuel?",
                "If 4 students can clean a classroom in 5 hours, how long will it take for 7 students to clean the same classroom?",
                "If a train travels at a speed of 120 km/h, how long will it take to cover a distance of 360 km?",
                "If a motorbike can cover 180 miles on 6 gallons of gasoline, how far can it travel on 3 gallons?",
                "If a machine can produce 300 toys in 4 hours, how many toys can it produce in 2 hours?",
                "If a chef can prepare 60 pizzas in 120 minutes, how many can they prepare in 5 hours?",
                "If a car can go 80 miles on 4 gallons of gas, how many miles can it go on 8 gallons?",
                "If 5 workers can build a house in 90 days, how long will it take for 10 workers to build the same house?",
                "If a machine can produce 160 units in 8 hours, how many units can it produce in 12 hours?",
                "If a printer can print 90 pages in 9 minutes, how many pages can it print in 45 minutes?",
                "If a factory can produce 7000 widgets in a week, how many can it produce in 5 weeks?",
                "If a bakery can bake 55 cupcakes in 5 hours, how many cupcakes can it bake in 7 hours?",
                "If a garden hose can fill a 2000-liter tank in 50 minutes, how long will it take to fill a 2500-liter tank?",
                "If a car can hold 100 liters of fuel and travels 600 km on a full tank, how far will it travel on 80 liters of fuel?",
                "If 3 students can clean a classroom in 4 hours, how long will it take for 6 students to clean the same classroom?",
                "If a train travels at a speed of 150 km/h, how long will it take to cover a distance of 450 km?",
                "If a motorbike can cover 140 miles on 5 gallons of gasoline, how far can it travel on 7 gallons?",
                "If a machine can produce 250 toys in 3 hours, how many toys can it produce in 5 hours?",
                "If a chef can prepare 45 pizzas in 90 minutes, how many can they prepare in 6 hours?",
                "If a car can go 90 miles on 3 gallons of gas, how many miles can it go on 6 gallons?",
                "If 4 workers can build a house in 135 days, how long will it take for 9 workers to build the same house?",
                "If a machine can produce 180 units in 9 hours, how many units can it produce in 6 hours?",
                "If a printer can print 100 pages in 10 minutes, how many pages can it print in 50 minutes?",
                "If a factory can produce 10,000 widgets in a week, how many can it produce in 8 weeks?",
                "If a bakery can bake 60 cupcakes in 6 hours, how many cupcakes can it bake in 10 hours?",
                "If a garden hose can fill a 2500-liter tank in 60 minutes, how long will it take to fill a 3000-liter tank?",
                "If a car can hold 110 liters of fuel and travels 660 km on a full tank, how far will it travel on 90 liters of fuel?"
            ],
            "responses":[
                "Oh... Direct variation"
            ]
            
        },
        {
            "tag":"inverse",
            "patterns":[
                "If it takes 4 workers 6 hours to build a wall, how many workers are needed to build the same wall in 3 hours?",
                "No machine can produce 200 widgets in 5 hours. How long will it take for the same machine to produce 100 widgets?",
                "If no car can travel 120 miles in 4 hours, how long will it take for the same car to travel 180 miles at the same speed?",
                "No pump can fill a swimming pool in 10 hours. How long will it take to fill the same pool with two pumps working simultaneously?",
                "If 6 students can complete a project in 15 days, how many days are needed for 4 students to complete the same project?",
                "A factory can manufacture 500 toys in 4 hours. How many toys can no factory produce in 8 hours?",
                "If no train can travel 240 miles in 6 hours, how long will it take to travel 320 miles at the same speed?",
                "A garden can be weeded by 5 people in 10 hours. How long will it take for 10 people to weed the same garden?",
                "If 8 machines can complete a task in 12 hours, how many hours are needed for 12 machines to complete the same task?",
                "No water tank can be filled by a tap in 15 minutes. How long will it take to fill the same tank with three taps running together?",
                "A car can travel 180 miles in 3 hours. How long will it take for no car to travel 90 miles at the same speed?",
                "If no pump can fill a swimming pool in 8 hours, how long will it take to fill the same pool with three pumps working simultaneously?",
                "A factory can produce 800 items in 4 hours. How many items can no factory produce in 10 hours?",
                "If it takes 5 workers 10 hours to construct a building, how many workers are needed to construct the same building in 5 hours?",
                "No machine can produce 240 widgets in 8 hours. How long will it take for the same machine to produce 120 widgets?",
                "If no car can travel 150 miles in 6 hours, how long will it take for the same car to travel 200 miles at the same speed?",
                "A pump can fill a swimming pool in 8 hours. How long will it take to fill the same pool with four pumps working simultaneously?",
                "If 10 students can complete a project in 12 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 400 toys in 5 hours. How many toys can no factory produce in 8 hours?",
                "If no train can travel 160 miles in 4 hours, how long will it take to travel 240 miles at the same speed?",
                "A garden can be weeded by 4 people in 8 hours. How long will it take for 8 people to weed the same garden?",
                "If 6 machines can complete a task in 9 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 12 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 200 miles in 2 hours. How long will it take for no car to travel 100 miles at the same speed?",
                "If it takes 8 workers 12 hours to paint a house, how many workers are needed to paint the same house in 6 hours?",
                "No machine can produce 360 widgets in 12 hours. How long will it take for the same machine to produce 180 widgets?",
                "If no car can travel 240 miles in 8 hours, how long will it take for the same car to travel 300 miles at the same speed?",
                "A pump can fill a swimming pool in 6 hours. How long will it take to fill the same pool with three pumps working simultaneously?",
                "If 12 students can complete a project in 10 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 600 toys in 6 hours. How many toys can no factory produce in 9 hours?",
                "If no train can travel 180 miles in 6 hours, how long will it take to travel 240 miles at the same speed?",
                "A garden can be weeded by 3 people in 9 hours. How long will it take for 6 people to weed the same garden?",
                "If 10 machines can complete a task in 15 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 18 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 240 miles in 4 hours. How long will it take for no car to travel 120 miles at the same speed?",
                "If it takes 6 workers 18 hours to build a wall, how many workers are needed to build the same wall in 9 hours?",
                "No machine can produce 120 widgets in 3 hours. How long will it take for the same machine to produce 60 widgets?",
                "If no car can travel 180 miles in 6 hours, how long will it take for the same car to travel 240 miles at the same speed?",
                "A pump can fill a swimming pool in 4 hours. How long will it take to fill the same pool with four pumps working simultaneously?",
                "If 9 students can complete a project in 15 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 450 toys in 9 hours. How many toys can no factory produce in 12 hours?",
                "If no train can travel 160 miles in 8 hours, how long will it take to travel 240 miles at the same speed?",
                "A garden can be weeded by 4 people in 12 hours. How long will it take for 8 people to weed the same garden?",
                "If 8 machines can complete a task in 18 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 20 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 200 miles in 5 hours. How long will it take for no car to travel 100 miles at the same speed?",
                "If it takes 5 workers 15 hours to construct a building, how many workers are needed to construct the same building in 7 hours?",
                "No machine can produce 300 widgets in 10 hours. How long will it take for the same machine to produce 150 widgets?",
                "If no car can travel 150 miles in 5 hours, how long will it take for the same car to travel 200 miles at the same speed?",
                "A pump can fill a swimming pool in 7 hours. How long will it take to fill the same pool with three pumps working simultaneously?",
                "If 10 students can complete a project in 14 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 480 toys in 6 hours. How many toys can no factory produce in 9 hours?",
                "If no train can travel 140 miles in 7 hours, how long will it take to travel 210 miles at the same speed?",
                "A garden can be weeded by 5 people in 15 hours. How long will it take for 10 people to weed the same garden?",
                "If 7 machines can complete a task in 21 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 24 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 220 miles in 6 hours. How long will it take for no car to travel 110 miles at the same speed?",
                "If it takes 6 workers 16 hours to paint a house, how many workers are needed to paint the same house in 8 hours?",
                "No machine can produce 420 widgets in 14 hours. How long will it take for the same machine to produce 210 widgets?",
                "If no car can travel 140 miles in 7 hours, how long will it take for the same car to travel 210 miles at the same speed?",
                "A pump can fill a swimming pool in 5 hours. How long will it take to fill the same pool with four pumps working simultaneously?",
                "If 9 students can complete a project in 12 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 540 toys in 9 hours. How many toys can no factory produce in 12 hours?",
                "If no train can travel 120 miles in 8 hours, how long will it take to travel 180 miles at the same speed?",
                "A garden can be weeded by 3 people in 12 hours. How long will it take for 6 people to weed the same garden?",
                "If 8 machines can complete a task in 24 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 25 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 180 miles in 5 hours. How long will it take for no car to travel 90 miles at the same speed?",
                "If it takes 7 workers 21 hours to build a wall, how many workers are needed to build the same wall in 10 hours?",
                "No machine can produce 210 widgets in 7 hours. How long will it take for the same machine to produce 105 widgets?",
                "If no car can travel 120 miles in 5 hours, how long will it take for the same car to travel 150 miles at the same speed?",
                "A pump can fill a swimming pool in 6 hours. How long will it take to fill the same pool with three pumps working simultaneously?",
                "If 12 students can complete a project in 18 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 600 toys in 8 hours. How many toys can no factory produce in 10 hours?",
                "If no train can travel 180 miles in 9 hours, how long will it take to travel 240 miles at the same speed?",
                "A garden can be weeded by 4 people in 10 hours. How long will it take for 8 people to weed the same garden?",
                "If 10 machines can complete a task in 20 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 22 minutes. How long will it take to fill the same tank with two taps running together?",
                "A car can travel 220 miles in 5 hours. How long will it take for no car to travel 110 miles at the same speed?",
                "If it takes 8 workers 20 hours to paint a house, how many workers are needed to paint the same house in 10 hours?",
                "No machine can produce 360 widgets in 9 hours. How long will it take for the same machine to produce 180 widgets?",
                "If no car can travel 180 miles in 9 hours, how long will it take for the same car to travel 240 miles at the same speed?",
                "A pump can fill a swimming pool in 7 hours. How long will it take to fill the same pool with four pumps working simultaneously?",
                "If 9 students can complete a project in 10 days, how many days are needed for no students to complete the same project?",
                "A factory can manufacture 450 toys in 7 hours. How many toys can no factory produce in 9 hours?",
                "If no train can travel 140 miles in 10 hours, how long will it take to travel 210 miles at the same speed?",
                "A garden can be weeded by 5 people in 20 hours. How long will it take for 10 people to weed the same garden?",
                "If 7 machines can complete a task in 14 hours, how many hours are needed for no machines to complete the same task?",
                "No water tank can be filled by a tap in 28 minutes. How long will it take to fill the same tank with two taps running together?"
            ],
            "responses":[
                "Inverse variation........Hmmm...."
            ]
        }
    ]
}